Sync async and host binding design docs
